Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: Learn more about the notion of extension registry and how you can use your own.
pt_br: Saiba mais sobre a noção de registro de extensão e como você pode usar o seu próprio.

source: Learn more about what we call a Platform in the Quarkus world.
pt_br: Saiba mais sobre o que chamamos de Plataforma no mundo Quarkus.

source: Learn step by step how to build a simple extension.
pt_br: Aprenda passo a passo como construir uma extensão simples.

source: Legacy API approach
pt_br: Abordagem API legada

source: Let's start a Redis server on the port 6379 using:
pt_br: Vamos iniciar um servidor Redis na porta 6379 usando:

source: Let’s go to the quark of things.
pt_br: Vamos ao quark das coisas.

source: Let’s start with the basics: HTTP microservices. In this context, you need to develop an HTTP endpoint, often called REST or CRUD. You process incoming HTTP requests, and to do so you often need to rely on other services, such as databases, or another HTTP service.
pt_br: Vamos começar com o básico: microsserviços HTTP. Nesse contexto, você precisa desenvolver um endpoint HTTP, geralmente chamado de REST ou CRUD. Você processa solicitações HTTP de entrada e, para isso, geralmente precisa confiar em outros serviços, como bancos de dados ou outro serviço HTTP.

source: Let’s take a very simple application handling <em>elements</em> from the periodic table. The code would be something like:
pt_br: Vamos pegar uma aplicação muito simples manipulando <em>elementos</em> da tabela periódica. O código seria algo como:

source: License
pt_br: Licença

source: Lightweight
pt_br: Leve

source: Like most Quarkus extensions, the Quarkus AWS Lambda HTTP/REST extensions support Live Coding.
pt_br: Tal como a maioria das extensões Quarkus, as extensões Quarkus AWS Lambda HTTP/REST suportam Live Coding.

source: Limit of client memory usage (in byte). The 64M default can guarantee a high producer throughput.
pt_br: Limite de uso de memória do cliente (em byte). O padrão de 64 milhões pode garantir uma alta taxa de transferência do produtor.

source: List all the configuration properties per extensions
pt_br: Listar todas as propriedades de configuração por extensões

source: List all the keys
pt_br: Lista todas as chaves

source: Listener name for lookup. Clients can use listenerName to choose one of the listeners as the service URL to create a connection to the broker as long as the network is accessible."advertisedListeners" must enabled in broker side.
pt_br: Nome do ouvinte para pesquisa. Os clientes podem usar listenerName para escolher um dos ouvintes como a URL do serviço para criar uma conexão com o broker, desde que a rede esteja acessível." advertisedListeners" deve ser habilitado no lado do corretor.

source: Listing and creating topics
pt_br: Listar e criar tópicos

source: Live Coding
pt_br: Codificação ao vivo

source: Live Coding and Simulating AWS Lambda Environment Locally
pt_br: Live Coding e simulação local do ambiente AWS Lambda

source: Mailer Reference Guide
pt_br: Guia de Referência do Mailer

source: Make sure you use a base image supporting virtual threads. Here we use an image providing Java 20.
pt_br: Certifique-se de que você utiliza uma imagem base que suporta threads virtuais. Aqui usamos uma imagem que fornece Java 20.

source: Make sure your `application.properties` contains the configuration explained in xref:native[the native compilation section].
pt_br: Certifique-se de que o seu `application.properties` contém a configuração explicada na xref:native[seção de compilação nativa].

source: Manage your MongoDB schema migrations with Liquibase.
pt_br: Gerencie suas migrações de esquema do MongoDB com o Liquibase.

source: Mandatory
pt_br: Obrigatório

source: Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately]
pt_br: Mandrel ou GraalVM instalado e xref:building-native-image.adoc#configuring-graalvm[configurado adequadamente]

source: Manually using the micro base image
pt_br: Utilizando a micro imagem base manualmente

source: Manually using the minimal base image
pt_br: Utilizando manualmente a imagem base mínima

source: Mapping Configuration to Objects
pt_br: Mapeando a configuração para objetos

source: Max backoff interval (in nanosecond).
pt_br: Intervalo máximo de recuo (em nanossegundos).

source: Maximum duration for completing a request.
pt_br: Duração máxima para concluir uma solicitação.

source: Maximum number of lookup requests allowed on each broker connection to prevent overloading a broker.
pt_br: Número máximo de solicitações de pesquisa permitidas em cada conexão do broker para evitar a sobrecarga de um broker.

source: Maximum number of rejected requests of a broker in a certain time frame (60 seconds) after the current connection is closed and the client creating a new connection to connect to a different broker.
pt_br: Número máximo de solicitações rejeitadas de um broker em um determinado período de tempo (60 segundos) após a conexão atual ser fechada e o cliente criar uma nova conexão para se conectar a um broker diferente.

source: Maximum number of times that a message will be redelivered before being sent to the dead letter topic
pt_br: Número máximo de vezes que uma mensagem será entregue novamente antes de ser enviada para o tópico de letra morta

source: Maximum read time of a request.
pt_br: Tempo máximo de leitura de uma solicitação.

source: Maximum times of redirected lookup requests.
pt_br: Tempos máximos de solicitações de pesquisa redirecionadas.

source: May 2, 2019
pt_br: maio 2, 2019

source: Measuring Performance
pt_br: Medindo o desempenho

source: Measuring the coverage of your tests
pt_br: Medindo a cobertura de seus testes

source: Message data compression type used by a producer. + Available options: + * https://github.com/lz4/lz4[LZ4] + * https://zlib.net/[ZLIB] + * https://facebook.github.io/zstd/[ZSTD] + * https://google.github.io/snappy/[SNAPPY]
pt_br: Tipo de compactação de dados de mensagem usado por um produtor. + Opções disponíveis: + * https://github.com/lz4/lz4[LZ4] + * https://zlib.net/[ZLIB] + * https://facebook.github.io/zstd/[ZSTD] + * https://google.github.io/snappy/[SNAPPY]

source: Message routing logic for producers on https://pulsar.apache.org/docs/concepts-architecture-overview#partitioned-topics[partitioned topics]. + Apply the logic only when setting no key on messages. + Available options are as follows: + * `pulsar.RoundRobinDistribution`: round robin + * `pulsar.UseSinglePartition`: publish all messages to a single partition + * `pulsar.CustomPartition`: a custom partitioning scheme
pt_br: Lógica de roteamento de mensagens para produtores em https://pulsar.apache.org/docs/concepts-architecture-overview#partitioned-topics[partitioned topics]. + Aplique a lógica somente ao definir nenhuma tecla nas mensagens. + As opções disponíveis são as seguintes: + * 'pulsar. RoundRobinDistribution': round robin + * 'pulsar. UseSinglePartition': publicar todas as mensagens em uma única partição + * 'pulsar. CustomPartition': um esquema de particionamento personalizado

source: Message send timeout in ms. + If a message is not acknowledged by a server before the `sendTimeout` expires, an error occurs.
pt_br: Tempo limite de envio de mensagem em ms. + Se uma mensagem não for reconhecida por um servidor antes que o 'sendTimeout' expire, ocorrerá um erro.

source: Messaging
pt_br: Mensagens

source: Microservices tend to come in systems. Let’s now imagine you need to access another HTTP endpoint. You can use an HTTP client directly; this is nothing more than repeating boilerplate code. Quarkus provides a way to call HTTP endpoints easily using the <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.
pt_br: Os microsserviços tendem a vir em sistemas. Agora vamos imaginar que você precise acessar outro endpoint HTTP. Você pode usar um cliente HTTP diretamente; isso nada mais é do que repetir código clichê. O Quarkus fornece uma maneira de chamar endpoints HTTP facilmente usando a <a href="https://quarkus.io/guides/rest-client">MicroProfile Rest Client API</a>.

source: Migrating from RESTEasy Classic to RESTEasy Reactive
pt_br: Migrando do RESTEasy Classic para o RESTEasy Reactive

source: Miscellaneous
pt_br: Diversos

source: Model
pt_br: Modelo

source: Modern applications often need to run specific tasks periodically. In this guide, you learn how to schedule periodic tasks.
pt_br: Aplicações modernas geralmente precisam executar tarefas específicas periodicamente. Neste guia, você aprenderá a agendar tarefas periódicas.

source: MongoDB Client
pt_br: Cliente MongoDB

source: MongoDB with Panache
pt_br: MongoDB com Panache

source: MongoDB with Panache and Kotlin
pt_br: MongoDB com Panache e Kotlin

source: Monitoring Option
pt_br: Opção de monitoração

source: Monopolization cases
pt_br: Casos de monopolização

source: More complex code
pt_br: Código mais complexo

source: Mount the host's directory `target/native-image` to the container's `/work`. Thus, the generated binary will also be written to this directory.
pt_br: Monte o diretório raiz `target/native-image` no diretório do contêiner `/work`. Assim, o binário gerado também será escrito neste diretório.

source: Multiple ways to connect with others via forum, stack, chat, or email groups.
pt_br: Várias maneiras de se conectar com outras pessoas por meio de fóruns, Stack Overflow, bate-papo ou grupos de e-mail.

source: Mutiny, Reactive for Bare Mortals
pt_br: Mutiny, reativo para simples mortais

source: Name of the dead letter topic where the failing messages will be sent
pt_br: Nome do tópico de dead letter para onde as mensagens com falha serão enviadas

source: Name of the initial subscription name of the dead letter topic
pt_br: Nome do nome da assinatura inicial do tópico de dead letter

source: Name of the retry topic where the failing messages will be sent
pt_br: Nome do tópico de repetição para onde as mensagens com falha serão enviadas

source: Native Image Pre-Boot
pt_br: Pré-inicialização da imagem nativa

source: Native Reference
pt_br: Referência nativa

source: Need More Than Community Support?
pt_br: Precisa de mais do que apoio da comunidade?

source: Neo4j Client
pt_br: Cliente Neo4j

source: Next Steps
pt_br: Próximos Passos

source: Next steps
pt_br: Próximas etapas

source: No hassle native executable generation
pt_br: Geração de executável nativo sem complicações

source: Note that all three models can be used in a single application.
pt_br: Note-se que os três modelos podem ser utilizados numa única aplicação.

source: Note that the Kafka advertised address is automatically configured with the chosen port.
pt_br: Note que o endereço anunciado do Kafka é automaticamente configurado com a porta escolhida.

source: Note that the Pulsar advertised address is automatically configured with the chosen port.
pt_br: Note que o endereço anunciado pelo Pulsar é automaticamente configurado com a porta escolhida.

source: Note that the virtual thread may not be re-mounted on the same carrier thread.
pt_br: Note-se que a thread virtual pode não ser montada novamente na mesma carrier thread.

source: November 19, 2019
pt_br: 19 de novembro de 2019

source: Now Available
pt_br: Agora disponível

source: Now, running the command `curl http://localhost:8080/increments/first` should return the following result:
pt_br: Agora, ao executar o comando `curl http://localhost:8080/incrementos/primeira` deve retornar o seguinte resultado:

source: Now, running the command `curl http://localhost:8080/increments` should return an empty list `[]`
pt_br: Agora, ao executar o comando `curl http://localhost:8080/incrementos` deve retornar uma lista vazia `[]`

source: Number of IO threads.
pt_br: Número de threads de E/S.

source: Number of connections established between the client and each Broker. A value of 0 means to disable connection pooling.
pt_br: Número de conexões estabelecidas entre o cliente e cada Broker. Um valor 0 significa desabilitar o pool de conexões.

source: Number of consumer listener threads.
pt_br: Número de threads de consumer listeners.

source: OS thread
pt_br: Thread do SO

source: Observability
pt_br: Observabilidade

source: Oh and did we mention some cool swag?
pt_br: Ah, e nós mencionamos algum swag legal?

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
pt_br: Oh sim! Tivemos algumas extensões escritas fora da equipe "inicial" do Quarkus.

source: On Linux, you will need GCC, and the glibc and zlib headers. Examples for common distributions:
pt_br: No Linux, é necessário o GCC e os headers glibc e zlib. Exemplos de distribuições comuns:

source: On Windows, you will have to go through the Control Panel to set your environment variables.
pt_br: No Windows, você terá que ir até o Painel de Controle para definir as suas variáveis de ambiente.

source: On Windows, you will need to install the https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]
pt_br: No Windows, terá de instalar link:https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]

source: On macOS (not supported by Mandrel), point the variable to the `Home` sub-directory:
pt_br: No macOS (não suportado pelo Mandrel), aponte a variável para o subdiretório `Home`:

source: Once the build is finished, you can run the executable with:
pt_br: Quando a compilação estiver concluída, pode rodar o executável com:

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
pt_br: Um dos principais objetivos do Quarkus é a facilidade de extensibilidade e a construção de um ecossistema vibrante.

source: Open Source Utterly and Absolutely
pt_br: Código aberto total e absolutamente

source: Open another terminal and run the `curl http://localhost:8080/increments` command.
pt_br: Abra outro terminal e execute o comando `curl http://localhost:8080/increments.

source: OpenID Connect (OIDC) and OAuth2 Client and Filters Reference
pt_br: Referência de clientes e filtros OpenID Connect (OIDC) e OAuth2

source: OpenID Connect (OIDC) configuration properties
pt_br: Propriedades de configuração do OpenID Connect (OIDC)

source: Opinionated
pt_br: Dogmático

source: Optional: To specify a particular stream, use the `Dstream` option; for example: `-Dstream=3.0`
pt_br: Opcional: Para especificar uma versão, utilize a opção `Dstream`; por exemplo: `-Dstream=3.0`

source: Optional: To specify a particular stream, use the `stream` option; for example: `--stream=3.0`
pt_br: Opcional: Para especificar uma versão, utilize a opção `stream`; por exemplo: `--stream=3.0`

source: Optionally Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately] if you want to build a native executable (or Docker if you use a native container build)
pt_br: Opcionalmente, Mandrel ou GraalVM instalado e xref:building-native-image.adoc#configuring-graalvm[configurado apropriadamente] se você quiser criar um executável nativo (ou Docker se você usar uma compilação de contêiner nativo)

source: Optionally the xref:cli-tooling.adoc[Quarkus CLI] if you want to use it
pt_br: Opcionalmente, o xref:cli-tooling.adoc[Quarkus CLI] se você quiser usá-lo

source: Or start `gdb` with:
pt_br: Ou começar `gdb` com:

source: Our dependency injection solution is based on CDI. You can use JAX-RS annotations to define the REST endpoints. You can use JPA annotations to map your persistent entities and JTA annotations to declare the transaction boundaries. You can use Eclipse MicroProfile to configure and monitor your application. You can use Vert.x, Apache Camel and we support much more.
pt_br: Nossa solução de injeção de dependência é baseada em CDI. Você pode usar anotações JAX-RS para definir os endpoints REST. Você pode usar anotações JPA para mapear suas entidades persistentes e anotações JTA para declarar os limites da transação. Você pode usar o Eclipse MicroProfile para configurar e monitorar seu aplicativo. Você pode usar Vert.x, Apache Camel e nós suportamos muito mais.

source: Our monthly newsletters bring together articles, videos and perspectives from across the Quarkus community.
pt_br: Nosso boletim informativo mensal reúne artigos, vídeos e perspectivas de toda a comunidade Quarkus.

source: Outgoing Attributes of the 'smallrye-kafka' connector
pt_br: Atributos de saída do conector 'smallrye-kafka'

source: Outgoing Attributes of the 'smallrye-pulsar' connector
pt_br: Atributos de saída do conector 'smallrye-pulsar'

source: Packaging and running in JVM mode
pt_br: Empacotando e execução no modo JVM

source: Packaging the native executable in a container
pt_br: Empacotar o executável nativo em um container

source: Password of SOCKS5 proxy.
pt_br: Senha do proxy SOCKS5.

source: Password of TLS KeyStore.
pt_br: Senha do TLS KeyStore.

source: Password of TLS TrustStore.
pt_br: Senha do TLS TrustStore.

source: Path of TLS KeyStore.
pt_br: Caminho do TLS KeyStore.

source: Path of TLS TrustStore.
pt_br: Caminho do TLS TrustStore.

source: Path to the TLS certificate file.
pt_br: Caminho para o arquivo de certificado TLS.

source: Path to the TLS key file.
pt_br: Caminho para o arquivo de chave TLS.

source: Path to the trusted TLS certificate file.
pt_br: Caminho para o arquivo de certificado TLS confiável.

source: Pattern
pt_br: Padrão

source: Pinning cases
pt_br: Casos de fixação (pinning)

source: Platform thread
pt_br: Thread de plataforma

source: Please see the Quarkus Native Reference Guide for more detailed information on these monitoring options.
pt_br: Consulte o Guia de Referência do Quarkus Native para obter informações mais detalhadas sobre estas opções de monitoração.

source: Please see xref:native-and-ssl.adoc#working-with-containers[our Using SSL With Native Executables guide] for more information.
pt_br: Consulte o link:native-and-ssl.html#working-with-containers[nosso guia Usando SSL com executáveis nativos] para obter mais informações.

source: Post-update, if expected updates are missing, consider the following reasons:
pt_br: Se as atualizações esperadas estiverem faltando, considere os seguintes motivos:

source: Prefix for Kafka client `client.id` attribute. If defined configured or generated `client.id` will be prefixed with the given value, otherwise `kafka-producer-` is the prefix. Type: _string_
pt_br: Prefixo para o atributo 'client.id' do cliente Kafka. Se definido configurado ou gerado 'client.id' será prefixado com o valor dado, caso contrário 'kafka-producer-' é o prefixo. Tipo: _string_

source: Prerequisites
pt_br: Pré-requisitos

source: Principal Class
pt_br: Classe principal

source: Prior to Java 21, virtual threads are still an experimental feature, you need to start your application with the `--enable-preview` flag:
pt_br: Antes de Java 21, as threads virtuais ainda são uma funcionalidade experimental, portanto é necessário iniciar a aplicação com o parâmetro `--enable-preview`:

source: Priority level for a consumer to which a broker gives more priority while dispatching messages in Shared subscription type. + The broker follows descending priorities. For example, 0=max-priority, 1, 2,... + In Shared subscription type, the broker **first dispatches messages to the max priority level consumers if they have permits**. Otherwise, the broker considers next priority level consumers. + **Example 1** + If a subscription has consumerA with `priorityLevel` 0 and consumerB with `priorityLevel` 1, then the broker **only dispatches messages to consumerA until it runs out permits** and then starts dispatching messages to consumerB. + **Example 2** + Consumer Priority, Level, Permits + C1, 0, 2 + C2, 0, 1 + C3, 0, 1 + C4, 1, 2 + C5, 1, 1 + Order in which a broker dispatches messages to consumers is: C1, C2, C3, C1, C4, C5, C4.
pt_br: Nível de prioridade para um consumidor ao qual um corretor dá mais prioridade ao enviar mensagens no tipo de assinatura compartilhada. + O corretor segue prioridades decrescentes. Por exemplo, 0=max-priority, 1, 2,... + No tipo de assinatura compartilhada, o corretor **primeiro envia mensagens para os consumidores de nível máximo de prioridade se eles tiverem permissões**. Caso contrário, o corretor considera os consumidores de nível de prioridade seguinte. + **Exemplo 1** + Se uma assinatura tiver consumerA com 'priorityLevel' 0 e consumerB com 'priorityLevel' 1, o corretor **somente despachará mensagens para consumerA até que ele esgote as permissões** e, em seguida, começará a enviar mensagens para consumerB. + **Exemplo 2** + Prioridade do Consumidor, Nível, Licenças + C1, 0, 2 + C2, 0, 1 + C3, 0, 1 + C4, 1, 2 + C5, 1, 1 + A ordem em que um corretor envia mensagens para os consumidores é: C1, C2, C3, C1, C4, C5, C4.

source: Procedure
pt_br: Procedimento

source: Producer name
pt_br: Nome do produtor

source: Producer should take action when encryption fails. + * **FAIL**: if encryption fails, unencrypted messages fail to send. + * **SEND**: if encryption fails, unencrypted messages are sent.
pt_br: O produtor deve tomar medidas quando a criptografia falhar. + * **FAIL**: se a criptografia falhar, as mensagens não criptografadas não serão enviadas. + * **SEND**: se a criptografia falhar, mensagens não criptografadas serão enviadas.

source: Producing a native executable
pt_br: Desenvolvendo um executável nativo

source: Producing a native executable can lead to a few issues, and so it's also a good idea to run some tests against the application running in the native file. The reasoning is explained in the link:getting-started-testing#quarkus-integration-test[Testing Guide].
pt_br: Produzir um executável nativo pode gerar alguns problemas e, por isso, também é uma boa ideia executar alguns testes na aplicação em execução no arquivo nativo. O raciocínio é explicado no link:getting-started-testing#quarkus-integration-test[Guia de testes].

source: Programmatic Approach
pt_br: Abordagem Programática

source: Programmatically decide to set the transaction for rollback.
pt_br: Decida programaticamente definir a transação para reversão.

source: Propagate incoming record key to the outgoing record Type: _boolean_
pt_br: Propagar a chave de registro de entrada para o registro de saída Tipo: _boolean_

source: Pros
pt_br: Prós

source: Protocol of proxy service. proxyServiceUrl and proxyProtocol must be mutually inclusive.
pt_br: Protocolo do serviço de proxy. proxyServiceUrl e proxyProtocol devem ser mutuamente inclusivos.

source: Protocols of TLS.
pt_br: Protocolos de TLS.

source: Provide users with initial code for extensions when generating Quarkus applications on code.quarkus.io and all the Quarkus tooling. This guide explains how to create and configure a Codestart for an extension.
pt_br: Forneça aos usuários o código inicial para extensões ao gerar aplicativos Quarkus no code.quarkus.io e todas as ferramentas do Quarkus. Este guia explica como criar e configurar um Codestart para uma extensão.

source: Publishing new records
pt_br: Publicação de novos registros

source: Pulsar client Attributes
pt_br: Atributos do cliente Pulsar

source: Pulsar cluster HTTP URL to connect to a broker.
pt_br: URL HTTP do cluster pulsar para se conectar a um broker.

source: Pulsar consumer Attributes
pt_br: Atributos do consumidor Pulsar

source: Pulsar producer Attributes
pt_br: Atributos do produtor Pulsar

source: Quarkus Build Time Principle
pt_br: Princípio do tempo de compilação do Quarkus

source: Quarkus Chat Options
pt_br: Opções de bate-papo do Quarkus
